In [5]:
from matplotlib import pyplot as plt
from scipy import stats
import pandas as pd
import numpy as np

#Data set resourced from kaggle.com
#https://www.kaggle.com/datasets/ruchi798/data-science-job-salaries

In [7]:
#create primary data frames for rough analysis

data_science_salaries = pd.read_csv("Resources/Latest_Data_Science_Salaries.csv")
data_science_salaries.head()

,Job Title,Employment Type,Experience Level,Expertise Level,Salary,Salary Currency,Company Location,Salary in USD,Employee Residence,Company Size,Year
0,Data Engineer,Full-Time,Senior,Expert,210000,United States Dollar,United States,210000,United States,Medium,2023
1,Data Engineer,Full-Time,Senior,Expert,165000,United States Dollar,United States,165000,United States,Medium,2023
2,Data Engineer,Full-Time,Senior,Expert,185900,United States Dollar,United States,185900,United States,Medium,2023
3,Data Engineer,Full-Time,Senior,Expert,129300,United States Dollar,United States,129300,United States,Medium,2023
4,Data Scientist,Full-Time,Senior,Expert,140000,United States Dollar,United States,140000,United States,Medium,2023

In [28]:
#identify top job titles with 100+ data points per title
job_title_count= data_science_salaries.groupby("Job Title")
job_title_count["Job Title"].count().sort_values(ascending=False)

Job Title
Data Engineer                      702
Data Scientist                     635
Data Analyst                       459
Machine Learning Engineer          300
Analytics Engineer                 132
                                  ...
Data Engineer 2                      1
Data DevOps Engineer                 1
Cloud Data Architect                 1
Data Science Tech Lead               1
Staff Machine Learning Engineer      1
Name: Job Title, Length: 111, dtype: int64

In [30]:
#breakdown of employees residence by country
country_count= data_science_salaries.groupby("Employee Residence")
country_count["Employee Residence"].count().sort_values(ascending=False)

Employee Residence
United States     2453
United Kingdom     245
Canada             101
Germany             58
India               57
                  ...
Kenya                1
Malta                1
Malaysia             1
Luxembourg           1
Algeria              1
Name: Employee Residence, Length: 83, dtype: int64

In [31]:
#breakdown of employees by expertise level
expertise_level_count= data_science_salaries.groupby("Expertise Level")
expertise_level_count["Expertise Level"].count().sort_values(ascending=False)

Expertise Level
Expert          2065
Intermediate     797
Junior           292
Director         146
Name: Expertise Level, dtype: int64

In [33]:
#analyse expertise level to better understand the diveresity in job titles to support focus
#on job title vs expertise level
expertise_level_dir = data_science_salaries.loc[data_science_salaries["Expertise Level"] == "Director" , :]
expertise_level_dir.head(10)

,Job Title,Employment Type,Experience Level,Expertise Level,Salary,Salary Currency,Company Location,Salary in USD,Employee Residence,Company Size,Year
47,Business Intelligence Engineer,Full-Time,Executive,Director,247500,United States Dollar,United States,247500,United States,Medium,2023
48,Business Intelligence Engineer,Full-Time,Executive,Director,172200,United States Dollar,United States,172200,United States,Medium,2023
59,Data Engineer,Full-Time,Executive,Director,205785,United States Dollar,United Kingdom,205785,United Kingdom,Medium,2023
60,Data Engineer,Full-Time,Executive,Director,123471,United States Dollar,United Kingdom,123471,United Kingdom,Medium,2023
131,Data Engineer,Full-Time,Executive,Director,130002,United States Dollar,United States,130002,United States,Medium,2023
132,Data Engineer,Full-Time,Executive,Director,71908,United States Dollar,United States,71908,United States,Medium,2023
167,Data Engineer,Full-Time,Executive,Director,174500,United States Dollar,United States,174500,United States,Medium,2023
168,Data Engineer,Full-Time,Executive,Director,113000,United States Dollar,United States,113000,United States,Medium,2023
189,Data Scientist,Full-Time,Executive,Director,299500,United States Dollar,United States,299500,United States,Medium,2023
190,Data Scientist,Full-Time,Executive,Director,249600,United States Dollar,United States,249600,United States,Medium,2023

In [34]:
#analyse expertise level to better understand the diveresity in job titles to support focus
#on job title vs expertise level
expertise_level_jr = data_science_salaries.loc[data_science_salaries["Expertise Level"] == "Junior" , :]
expertise_level_jr.head(10)

,Job Title,Employment Type,Experience Level,Expertise Level,Salary,Salary Currency,Company Location,Salary in USD,Employee Residence,Company Size,Year
65,AI Programmer,Full-Time,Entry,Junior,40000,United States Dollar,"Korea, Republic of",40000,"Korea, Republic of",Small,2023
100,Research Engineer,Full-Time,Entry,Junior,30000,Euro,France,32390,France,Medium,2023
241,Data Analyst,Full-Time,Entry,Junior,90000,United States Dollar,United States,90000,United States,Medium,2023
242,Data Analyst,Full-Time,Entry,Junior,60000,United States Dollar,United States,60000,United States,Medium,2023
249,Data Analyst,Full-Time,Entry,Junior,40000,British Pound Sterling,United Kingdom,49216,United Kingdom,Medium,2023
250,Data Analyst,Full-Time,Entry,Junior,34000,British Pound Sterling,United Kingdom,41833,United Kingdom,Medium,2023
319,Data Engineer,Full-Time,Entry,Junior,80000,United States Dollar,United States,80000,United States,Medium,2023
320,Data Engineer,Full-Time,Entry,Junior,52500,United States Dollar,United States,52500,United States,Medium,2023
348,Data Analyst,Full-Time,Entry,Junior,55000,Canadian Dollar,Canada,40747,Canada,Large,2023
379,Research Scientist,Full-Time,Entry,Junior,200000,United States Dollar,United States,200000,United States,Medium,2023

In [35]:
#analyse expertise level to better understand the diveresity in job titles to support focus
#on job title vs expertise level
title_data_analyst = data_science_salaries.loc[data_science_salaries["Job Title"] == "Data Analyst" , :]
title_data_analyst.head(10)

,Job Title,Employment Type,Experience Level,Expertise Level,Salary,Salary Currency,Company Location,Salary in USD,Employee Residence,Company Size,Year
22,Data Analyst,Full-Time,Senior,Expert,204500,United States Dollar,United States,204500,United States,Medium,2023
23,Data Analyst,Full-Time,Senior,Expert,138900,United States Dollar,United States,138900,United States,Medium,2023
53,Data Analyst,Full-Time,Senior,Expert,169000,United States Dollar,United States,169000,United States,Medium,2023
54,Data Analyst,Full-Time,Senior,Expert,110600,United States Dollar,United States,110600,United States,Medium,2023
75,Data Analyst,Full-Time,Senior,Expert,49200,Euro,Estonia,53120,Estonia,Medium,2023
76,Data Analyst,Full-Time,Senior,Expert,36000,Euro,Estonia,38868,Estonia,Medium,2023
96,Data Analyst,Full-Time,Senior,Expert,120350,United States Dollar,United States,120350,United States,Medium,2023
97,Data Analyst,Full-Time,Senior,Expert,74400,United States Dollar,United States,74400,United States,Medium,2023
127,Data Analyst,Full-Time,Senior,Expert,168000,United States Dollar,United States,168000,United States,Large,2023
128,Data Analyst,Full-Time,Senior,Expert,78400,United States Dollar,United States,78400,United States,Large,2023

In [45]:
#Final data clean up, as a group we decided to focus on top 5 job titles in order to gather 
#sufficient data point for our data exploration and analysis
#exporting to new csv file
job_title_clean = data_science_salaries.loc[data_science_salaries["Job Title"].isin(["Data Engineer",
                                            "Data Scientist", "Data Analyst", "Machine Learning Engineer",
                                            "Analytics Engineer"])]
job_title_clean

,Job Title,Employment Type,Experience Level,Expertise Level,Salary,Salary Currency,Company Location,Salary in USD,Employee Residence,Company Size,Year
0,Data Engineer,Full-Time,Senior,Expert,210000,United States Dollar,United States,210000,United States,Medium,2023
1,Data Engineer,Full-Time,Senior,Expert,165000,United States Dollar,United States,165000,United States,Medium,2023
2,Data Engineer,Full-Time,Senior,Expert,185900,United States Dollar,United States,185900,United States,Medium,2023
3,Data Engineer,Full-Time,Senior,Expert,129300,United States Dollar,United States,129300,United States,Medium,2023
4,Data Scientist,Full-Time,Senior,Expert,140000,United States Dollar,United States,140000,United States,Medium,2023
...,...,...,...,...,...,...,...,...,...,...,...
3289,Machine Learning Engineer,Full-Time,Senior,Expert,40000,Euro,Croatia,45618,Croatia,Small,2020
3291,Data Scientist,Full-Time,Mid,Intermediate,160000,Singapore Dollar,Israel,119059,Singapore,Medium,2021
3293,Data Engineer,Full-Time,Mid,Intermediate,24000,Euro,Malta,28369,Malta,Large,2021
3295,Data Scientist,Full-Time,Senior,Expert,412000,United States Dollar,United States,412000,United States,Large,2020
3297,Data Scientist,Full-Time,Entry,Junior,105000,United States Dollar,United States,105000,United States,Small,2020